'''問題描述【列出真分數序列】
按遞增順序依次列出所有分母為40，分子小於40的最簡分數
'''

'''問題分析
最簡分數，分子和分母只有公因數1的分數，或者說分子和分母是互質數的分數
【一】对分子进行穷举
【二】分子和分母在1～分子之间除了1之外还有其他公因数，
'''

'''方法1'''
if __name__ =="__main__":
    print("分母为40，分子小于40的最简分数有：")
    # 计数器，记录最简分数的个数
    n= 0 
    # 穷举40以内的全部分子
    for i in range(1,40):
        # 分母num1
        num1 = 40 
        # 分子num2 
        num2 = i 
        # 采用辗转相除法求出分子与分母的最大公约数
        while num2 != 0:
            temp = num1 % num2 
            num1 = num2 
            num2 = temp 
        # 若最大公约数为1，则为最简真分数
        if num1 == 1:
            n+= 1
            print("%2d/40"%i,end=" ")
'''方法2'''
# if __name__ =="__main__":
#     print("分母为40，分子小于40的最简分数有: ")
#     #  计数器，记录最简分数的个数
#     n = 0 
#     for i in range(1,40):
#         num1 = 40 
#         num2 = i
#         j = 2 
#         while j <= num2:
#             # 判斷2～num2之間分子和分母是否有公約數
#             # 如果j滿足條件，則結束循環，說明此時的分數不是最簡分數
#             if (num1 % j ==0) and (num2 % j ==0):
#                 break
#             j+= 1
#         # 如果j>num2，說明2～num2之間沒有分子和分母的公約數，分數為最簡分數
#         if j>num2:
#             print("%2d/40"%i,end=' ')
#             n += 1
'''擴展訓練
按遞增順序依次列出所有分母小於等於40的最簡真分數
'''
if __name__ =="__main__":
    print("分母小於等於40的最簡分數有： ")
    for k in range(1,40+1):
        # 分母
        num1 = k
        # 計數器 
        n = 0
        # 窮舉40以內的全部分子
        for i in range(1,num1):
            num2 = i 
            j = 2 
            while j<= num2:
                if (num1 * j == 0) and (num2 *j==0):
                    break
                j+= 1
            # 如果j>num2，說明2～num2之間沒有分子和分母的公約數，分數為最簡分數
            if j>num2:
                print("%2d/%2d"%(num2,num1),end=" ")
                n+= 1