'''問題描述【旅客國籍】
在一个旅馆中住着6个不同国籍的人，他们分别来自美国、德 国、英国、法国、俄罗斯和意大利。他们的名字分别叫A、B、C、 D、E和F，
要说明的是名字的顺序与前面提到的国籍不一定是相互对 应的。现在已知:
    1)A和美国人是医生。
    2)E和俄罗斯人是教师。
    3)C和德国人是技师。
    4)B和F曾经当过兵，而德国人从未参过军。
    5)法国人比A年龄大，意大利人比C年龄大。
    6)B同美国人下周要去西安旅行，而C同法国人下周要去杭州度 假。
现要求根据上述已知条件，编程求出A、B、C、D、E和F各是哪 国人。
'''

'''算法設計【使用條件矩陣】

'''


country = [" ","美","英","德","法","義大利","俄羅斯"]
def Nationality():
    # 初始化條件矩陣
    a = []
    for i in range(7):
        b = []
        for j in range(7):
            b.append(j)
        a.append(b)
    # 條件矩陣每一列德第0號元素作為改列數據處理的標記
    for i in range(1,7):
        # 標記該列尚未處理
        a[0][i] = 1

    # 輸入條件矩陣中各種條件
    a[1][1] = a[2][1] = a[3][1] = a[5][1] = 0
    # 0表示不是該國人
    a[1][3] = a[2][3] = a[3][3] = 0
    a[1][4] = a[2][4] = a[3][4] = a[5][4] = a[6][4] = 0
    a[3][5] = 0
    a[1][6] = a[3][6] = a[5][6] = 0
    x = 0 
    y = 0 
    while a[0][1]+a[0][2]+a[0][3]+a[0][4]+a[0][5]+a[0][6]>0:
        # 當所有處理完退出循環
        for i in range(1,7):
            # 
            if a[0][i]!=0:
                e = 0 
                for j in range(1,7):
                    if a[j][i]!=0:
                        # 統計該列中的非0個數
                        x = j 
                        y = i 
                        e+= 1 
                if e==1:
                    for t in range(1,7):
                        if t!=i:
                            a[x][t]=0
                    a[0][y] = 0 
    print("矩阵最终状态为:") 
    #输出执行消去操作后矩阵的最终状态 
    for i in range(7):
        print(a[i])
    print("推断结果为:") 
    for i in range(1, 7):
        print(chr(ord('A') - 1 + i), '来自: ', end='') 
        for j in range(1, 7):
            if a[i][j] != 0: 
                print(country[a[i][j]], '。') 
                break


if __name__ == '__main__':
    Nationality()

